tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CODES/reactingDNS/tuts/1D_H2_premixed_inletoutlet/constant/trandat
CO                 1    98.100     3.650     0.000     1.950     1.800
H2O                2   572.400     2.605     1.844     0.000     4.000
H2                 1    38.000     2.920     0.000     0.790   280.000
CO2                1   244.000     3.763     0.000     2.650     2.100
O2                 1   107.400     3.458     0.000     1.600     3.800
H2O2               2   107.400     3.458     0.000     0.000     3.800
OH                 1    80.000     2.750     0.000     0.000     0.000
HO2                2   107.400     3.458     0.000     0.000     1.000 ! *
H                  0   145.000     2.050     0.000     0.000     0.000
O                  0    80.000     2.750     0.000     0.000     0.000
AR                 0   136.500     3.330     0.000     0.000     0.000
N2                 1    97.530     3.621     0.000     1.760     4.000
HE                 0    10.200     2.576     0.000     0.000     0.000 ! *

!
! Transport data for H2/O2 reaction mechanism
! Li, J., Zhao, Z., Kazakov, A., and Dryer, F.L. "An Updated Comprehensive Kinetic Model
! for H2 Combustion", Fall Technical Meeting of the Eastern States Section of the
! Combustion Institute, Penn State University, University Park, PA, October 26-29, 2003.
!
